//=============================================================================
//
// リザルト画面処理 [result.cpp]
// Author : 川井一生
//
//=============================================================================
#include "main.h"
#include "result.h"
#include "weekloop.h"
#include "input.h"
#include "fade.h"

#include "result BG.h"
//=============================================================================
// マクロ定義
enum
{
	RESULT_1=0,
	RESULT_2,
	RESULT_3,
	RESULT_BAD,
	RESULT_MAX
};
//=============================================================================
// プロトタイプ宣言
int ChangeResultBG(void);

//=============================================================================
// グローバル変数
int ChangeResultBG;
//=============================================================================
// 初期化処理
void InitResult(void)
{
	ChangeResultBG = RESULT_1;
	InitResultBG();

	return;
}

//=============================================================================
// 終了処理
//=============================================================================
void UninitResult(void)
{
	UninitResultBG();

}

//=============================================================================
// 更新処理
//=============================================================================
void UpdateResult(void)
{
	if (GetKeyboardTrigger(DIK_F12))
	{
		ChangeResultBG();
	}

	//ポインタ取得
	WEEKLOOP* weekloop = GetWeeekloop();

	UpdateResultBG();

	if (GetKeyboardTrigger(DIK_RETURN))
	{
		SetFade(FADE_OUT, MODE_TITLE);
	}

}

//=============================================================================
// 描画処理
//=============================================================================
void DrawResult(void)
{
	/*ここではほかで書いたドローを呼ぶ*/
	/*↓↓↓こんな感じ*/

	DrawResultBG();
}

//=============================================================================
// リザルト画面切り替え処理
//=============================================================================
int ChangeResultBG(void)
{
		ChangeResultBG = (ChangeResultBG + 1) % RESULT_MAX;
}

//=============================================================================
// リザルト画面切り替え処理
//=============================================================================
int GetChangeResultBG(void)
{
	return(ChangeResultBG);
}