//=============================================================================
//
// スケジュール処理 [schedule.cpp]
// Author : 藤田高輔
//
//=============================================================================

/*******************************************************************************
* インクルードファイル
*******************************************************************************/
#include "main.h"
#include "game.h"
#include "weekloop.h"
#include "input.h"
#include "schedule.h"
#include "event.h"
#include "debugproc.h"

/******************************************************************************
* マクロ定義
******************************************************************************/

/******************************************************************************
* プロトタイプ宣言
******************************************************************************/

/******************************************************************************
* グローバル変数
******************************************************************************/
SCHEDULE g_schedule;		//グローバル変数（複数作成必要なし)

/******************************************************************************
* 初期化処理
******************************************************************************/
void InitSchedule(void)
{



	return;
}
/******************************************************************************
* 終了処理
******************************************************************************/
void UninitSchedule(void)
{



}
/******************************************************************************
* 更新関数
******************************************************************************/
void UpdateSchedule(void)
{
	//ポインタ取得
	SCHEDULE* schedule = GetSchedule();
	WEEKLOOP* weekloop = GetWeeekloop();

	//スケジュール選択開始&イベントへの遷移
	if (GetKeyboardTrigger(DIK_1))	//一番のライヴァルにアクション
	{
		schedule->com = ACTION_1;
		schedule->com_obj = IDX_RAIVAL00;
		//遷移も行う
		weekloop->loopmood = WEEKLOOP_EVENT;
		//緊急でここに書く
		InitEvent();
	}
	else if (GetKeyboardTrigger(DIK_2))	//一番のライヴァルにアクション
	{
		schedule->com = ACTION_1;
		schedule->com_obj = IDX_RAIVAL01;
		//遷移も行う
		weekloop->loopmood = WEEKLOOP_EVENT;
		//緊急でここに書く
		InitEvent();
	}
	else if (GetKeyboardTrigger(DIK_3))	//一番のライヴァルにアクション
	{
		schedule->com = ACTION_1;
		schedule->com_obj = IDX_RAIVAL02;
		//遷移も行う
		weekloop->loopmood = WEEKLOOP_EVENT;
		//緊急でここに書く
		InitEvent();
	}
	//デバッグ文字
#ifdef _DEBUG
	PrintDebugProc("1キー　２キー　３キーどれかおして\n");
#endif
}

/******************************************************************************
* 描画関数
******************************************************************************/
void DrawSchedule(void)
{

}

/******************************************************************************
* 描画関数
******************************************************************************/
SCHEDULE* GetSchedule(void)
{
	return &g_schedule;
}