//=============================================================================
//
// テキストボックスの処理 [text box.h]
// Author : 川井一生
//
//=============================================================================
#ifndef _TEXT_BOX_H_
#define _TEXT_BOX_H_

#include "main.h"
#include "basic.h"

//=============================================================================
// マクロ定義

//=============================================================================
// 構造体宣言
//テキスト構造体
typedef struct
{
	bool	use;
	POLY	poly;
	float	alpha;
	bool	display;
}TEXTBOX;

//=============================================================================
// プロトタイプ宣言
void InitTextBox(void);
void UninitTextBox(void);
void UpdateTextBox(void);
void DrawTextBox(void);
#endif