//=============================================================================
//
// タイトル画面処理 [title.cpp]
// Author : 川井一生
//
//=============================================================================
#include "main.h"
#include "title.h"

#include "title BG.h"

#include "input.h"
#include "fade.h"

//=============================================================================
// マクロ定義

//=============================================================================
// プロトタイプ宣言

//=============================================================================
// グローバル変数

//=============================================================================
// 初期化処理
void InitTitle(int oldMode)
{
	switch (oldMode)
	{
	case MODE_NULL:
		// 初めての初期化
		/*何も初期化されていあないと想定して、タイトル画面内で使うものを全部初期化*/

		InitTitleBG();

		break;
	case MODE_GAME:
		// ゲームになかった物だけ初期化
		/*ゲーム画面からタイトル画面へ切り替わった時に、ゲームで初期化されなかったものを初期化*/
		/*注意*/
		/*ゲーム画面で初期化されたものはリセット処理が必要な時がある*/

		//=========================
		// 初期化
		InitTitleBG();

		//=========================
		// リセット

		break;
	case MODE_RESULT:
		// リザルトになかった物だけ初期化
		/*リザルト画面からタイトル画面へ切り替わった時に、リザルトで初期化されなかったものを初期化*/
		/*注意*/
		/*リザルト画面で初期化されたものはリセット処理が必要な時がある*/

		//=========================
		// 初期化
		InitTitleBG();

		//=========================
		// リセット

		break;
	}

}

//=============================================================================
// 終了処理
//=============================================================================
void UninitTitle(int mode)
{
	switch (mode)
	{
	case MODE_GAME:
		// ゲームに使わないものをリリース
		/*タイトル画面からゲーム画面へ切り替えるときに、ゲーム画面で使わないものをリリース処理をする*/

		UninitTitleBG();

		break;
	case MODE_RESULT:
		// リザルトに使わないものをリリース
		/*タイトル画面からリザルト画面へ切り替えるときに、リザルト画面で使わないものをリリース処理をする*/

		UninitTitleBG();

		break;
	}
}

//=============================================================================
// 更新処理
//=============================================================================
void UpdateTitle(void)
{
	/*ここではほかで書いたアップデートを呼ぶ*/
	/*↓↓↓こんな感じ*/

	UpdateTitleBG();

	if (GetKeyboardTrigger(DIK_NUMPAD0))
	{
		SetFade(FADE_OUT, MODE_GAME);
	}

}

//=============================================================================
// 描画処理
//=============================================================================
void DrawTitle(void)
{
	/*ここではほかで書いたドローを呼ぶ*/
	/*↓↓↓こんな感じ*/

	DrawTitleBG();
}

